cosmoi.org
#+Title: Cosmoi
#+Author: Mario Román
#+Email: mromang08@gmail.com
#+Creator: <a href="https://mroman42.github.com">@mroman42</a>.

#+Options: toc:nil date:t num:nil
#+Options: html-style:nil
#+Options: html-postamble:t
#+Options: tex:dvisvgm

** Lawvere's fixed point theorem                                                             :post:
:PROPERTIES:
:TITLE: Lawvere's fixed point theorem
:EXPORT_FILE_NAME: lawverefixedpoint.html
:INDEX_DATE: <2019-02-28 Mon 10:23>
:END:

This is a note stating the main result 
from [[http://tac.mta.ca/tac/reprints/articles/15/tr15.pdf][Diagonal arguments and Cartesian Closed Categories]] by
William Lawvere.

*Definition.* A morphism s : X → Y is /point-surjective/ if for each y : 1
→ Y, there exists some x : 1 → X such that sx = y.

*Theorem* (Lawvere, 1969). In any cartesian closed category, if there exists a
point-surjective morphism d : A → (A → B), then each morphism f : B →
B has a fixed point, that is, some b : B such that f b = b.

*Proof.* As d is point-surjective, there exists x : A such that dx =
λa.f(daa), but then, dxx = (λa.f(daa)) x = f(dxx) is a fixed point.

