lawverefixedpoint.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-13 Sat 23:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lawvere's fixed point theorem</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" href="default.css" />
<link rel="stylesheet" href="mathjax_fonts.css" />
<link rel="stylesheet" href="syntax.css" />
<div id="header">
<div id="logo">
<a hrwef="index.html">Cosmoi</a>
</div>
<div id="navigation">
<a href="index.html">Index</a>
<a href="about.html">About</a>
<a href="feed.xml">RSS</a>
</div>
</div>
</head>
<body>
<div id="content">
<h1 class="title">Lawvere's fixed point theorem</h1>
<p>
This is a note stating the main result 
from <a href="http://tac.mta.ca/tac/reprints/articles/15/tr15.pdf">Diagonal arguments and Cartesian Closed Categories</a> by
William Lawvere.
</p>

<p>
<b>Definition.</b> A morphism s : X → Y is <i>point-surjective</i> if for each y : 1
→ Y, there exists some x : 1 → X such that sx = y.
</p>

<p>
<b>Theorem</b> (Lawvere, 1969). In any cartesian closed category, if there exists a
point-surjective morphism d : A → (A → B), then each morphism f : B →
B has a fixed point, that is, some b : B such that f b = b.
</p>

<p>
<b>Proof.</b> As d is point-surjective, there exists x : A such that dx =
λa.f(daa), but then, dxx = (λa.f(daa)) x = f(dxx) is a fixed point.
</p>
</div>
<div id="postamble" class="status">
<div id="footer"><p class="postamble">Last edited 2019-02-28 Thu 10:23. Written by <a href="https://mroman42.github.com">@mroman42</a>.</p></div>
</div>
</body>
</html>
